/****************************************************************************
 *
 * CRI Middleware SDK
 *
 * Copyright (c) 2015 CRI Middleware Co., Ltd.
 *
 * Library  : Sample Library
 * Module   : Utility
 *
 ****************************************************************************/

/***************************************************************************
 *      インクルードファイル
 *      Include files
 ***************************************************************************/
#include <stdio.h>
#include <string.h>
#include <cri_xpt.h>
#include "smp_utl.h"

/***************************************************************************
 *      定数マクロ
 *      Constant Macros
 ***************************************************************************/
/* アセットディレクトリ */
/* Asset directory */
#define PATH	"..\\..\\..\\..\\..\\common\\smpdata\\crifilesystem\\"

/***************************************************************************
 *      処理マクロ
 *      Process Macros
 ***************************************************************************/

/***************************************************************************
 *      変数定義
 *      Variable Definitions
 ***************************************************************************/

/***************************************************************************
 *      関数宣言
 *      Function Declaration
 ***************************************************************************/

/***************************************************************************
 *      関数定義
 *      Function Definitions
 ***************************************************************************/

/* アセットパスの生成 */
/* Make the asset path */
void smputl_get_asset_path(CriChar8 *dest, const CriChar8 *rel_path, CriSint32 n)
{
	SMPUTL_UNUSED(n);
	strcpy_s(dest, n, PATH);
	strcat_s(dest, n, rel_path);
}

/* プラットフォーム依存のロードバッファアライメントを取得する */
/* Get alignment of load buffer specific to platform */
CriSint32 smputl_get_load_buffer_alignment(void)
{
	/* 任意のアライメントで読み込み可能 */
	/* Files can be loaded at any alignment */
	return 1;
}

/* --- end of file --- */
