/****************************************************************************
 *
 * CRI Middleware SDK
 *
 * Copyright (c) 2015 CRI Middleware Co., Ltd.
 *
 * Library  : Sample Library
 * Module   : Utility
 *
 ****************************************************************************/
 /*!
 *	\file		smp_utl.h
 */

/* 多重定義防止					*/
/* Prevention of redefinition	*/
#ifndef	CRI_INCL_SMP_UTL_H
#define	CRI_INCL_SMP_UTL_H

/***************************************************************************
 *      インクルードファイル
 *      Include files
 ***************************************************************************/
#include "cri_xpt.h"

/***************************************************************************
 *      定数マクロ
 *      Macro Constants
 ***************************************************************************/

/***************************************************************************
 *      処理マクロ
 *      Macro Functions
 ***************************************************************************/
/* 未使用引数警告回避マクロ */
#ifndef SMPUTL_UNUSED
#define SMPUTL_UNUSED(arg)				{ if (&(arg) == &(arg)) {} }
#endif

/***************************************************************************
 *      データ型宣言
 *      Data Type Declarations
 ***************************************************************************/

/***************************************************************************
 *      変数宣言
 *      Prototype Variables
 ***************************************************************************/

/***************************************************************************
 *      関数宣言
 *      Prototype Functions
 ***************************************************************************/
#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* 初期化処理 */
void Sample_Initialize(void);

/* 更新処理 */
CriBool Sample_Update(void);

/* 終了処理 */
void Sample_Finalize(void);

/* アセットパスの生成 */
void smputl_get_asset_path(CriChar8 *dest, const CriChar8 *rel_path, CriSint32 n);

/* プラットフォーム依存のロードバッファアライメントを取得する */
/*
 * 具体的な値の根拠はCRI File Systemマニュアルのプラットフォーム固有情報、
 * およびプラットフォームSDKのドキュメントを参照してください。
*/
CriSint32 smputl_get_load_buffer_alignment(void);

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif	/* CRI_INCL_SMP_UTL_H */

/* --- end of file --- */

